; domain
(define (domain pathfinder)

(:requirements :strips :typing)

(:types location direction - object)

(:predicates
    (plate-at ?l - location)
    (wall-at ?l - location)
    (clear ?l - location)
    (connected ?l1 ?l2 - location ?d - direction)
    (in-motion ?d - direction)
    (not-in-motion)
    (at ?l - location)
)

(:action motion-clear
    :parameters (?l1 ?l2 - location ?d - direction)
    :precondition (and (in-motion ?d) (at ?l1) (connected ?l1 ?l2 ?d) (clear ?l2))
    :effect (and (not (at ?l1)) (at ?l2))
)

(:action motion-start
    :parameters (?d - direction)
    :precondition (not-in-motion)
    :effect (and (not (not-in-motion)) (in-motion ?d))
)

(:action motion-plate
    :parameters (?l1 ?l2 - location ?d - direction)
    :precondition (and (in-motion ?d) (at ?l1) (connected ?l1 ?l2 ?d) (plate-at ?l2))
    :effect (and (not (at ?l1)) (at ?l2) (not (plate-at ?l2)) (wall-at ?l2))  ;; Removed motion stopping effects
)

(:action motion-wall
    :parameters (?l1 ?l2 - location ?d - direction)
    :precondition (and (in-motion ?d) (at ?l1) (connected ?l1 ?l2 ?d) (wall-at ?l2))
    :effect (and (not (in-motion ?d)) (not-in-motion))
)

)

; problem
(define (problem p1) (:domain pathfinder)
(:objects 
    n e s w - direction
    l1 l2 l3 l4 
    l5 l6 l7 l8 lw 
    l9 l10 l11 l12 - location
)

(:init
    (connected l1 l2 e)
    (connected l2 l1 w)
    (connected l2 l3 e)
    (connected l3 l2 w)
    (connected l3 l4 e)
    (connected l4 l3 w)
    
    (connected l5 l6 e)
    (connected l6 l5 w)
    (connected l6 l7 e)
    (connected l7 l6 w)
    (connected l7 l8 e)
    (connected l8 l7 w)

    (connected l9 l10 e)
    (connected l10 l9 w)
    (connected l10 l11 e)
    (connected l11 l10 w)
    (connected l11 l12 e)
    (connected l12 l11 w)
    (connected l8 lw e)
    (connected lw l8 w)

    (connected l1 l5 s)
    (connected l5 l1 n)
    (connected l2 l6 s)
    (connected l6 l2 n)
    (connected l3 l7 s)
    (connected l7 l3 n)
    (connected l4 l8 s)
    (connected l8 l4 n)

    (connected l5 l9 s)
    (connected l9 l5 n)
    (connected l6 l10 s)
    (connected l10 l6 n)
    (connected l7 l11 s)
    (connected l11 l7 n)
    (connected l8 l12 s)
    (connected l12 l8 n)
    
    (wall-at lw)
    (wall-at l1)
    (clear l2)
    (clear l3)
    (clear l4)
    (clear l5)
    (plate-at l6)
    (clear l7)
    (clear l8)
    (clear l9)
    (clear l10)
    (clear l11)
    (clear l12)

    (at l9)
    (not-in-motion)

)

(:goal (and
    (at l3)
))
)

; plan
1. (motion-start n)
   deleted: (not-in-motion)
   added: (in-motion n)
   goals met: 0 of 1
2. (motion-clear l9 l5 n)
   deleted: (at l9)
   added: (at l5)
   goals met: 0 of 1
3. (motion-wall l5 l1 n)
   deleted: (in-motion n)
   added: (not-in-motion)
   goals met: 0 of 1
4. (motion-start e)
   deleted: (not-in-motion)
   added: (in-motion e)
   goals met: 0 of 1
5. (motion-plate l5 l6 e)
   deleted: (at l5) (plate-at l6)
   added: (at l6) (wall-at l6)
   goals met: 0 of 1
6. (motion-clear l6 l7 e)
   deleted: (at l6)
   added: (at l7)
   goals met: 0 of 1
7. (motion-clear l7 l8 e)
   deleted: (at l7)
   added: (at l8)
   goals met: 0 of 1
8. (motion-wall l8 lw e)
   deleted: (in-motion e)
   added: (not-in-motion)
   goals met: 0 of 1
9. (motion-start w)
   deleted: (not-in-motion)
   added: (in-motion w)
   goals met: 0 of 1
10. (motion-clear l8 l7 w)
   deleted: (at l8)
   added: (at l7)
   goals met: 0 of 1
11. (motion-wall l7 l6 w)
   deleted: (in-motion w)
   added: (not-in-motion)
   goals met: 0 of 1
12. (motion-start n)
   deleted: (not-in-motion)
   added: (in-motion n)
   goals met: 0 of 1
13. (motion-clear l7 l3 n)
   deleted: (at l7)
   added: (at l3)
   goals met: 1 of 1
